nxp-mcuxpresso/mcux-soc-svd/MCXW235/MCXW235.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>PMC</name>
      <description>PMC</description>
      <groupName>PMC</groupName>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x104</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>BOD1</name>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>BOD2</name>
        <value>28</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Power Management Control [Reset by: PoR, Pin Reset, Software Reset]</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>LPMODE</name>
              <description>Power Mode Control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>ACTIVE power mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEEPSLEEP</name>
                  <description>DEEP SLEEP low power mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERDOWN</name>
                  <description>POWER DOWN low power mode.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEEPPOWERDOWN</name>
                  <description>DEEP POWER DOWN low power mode.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELCLOCK</name>
              <description>Select the Power Management Controller (PMC) functional clock : .</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRO1MHZ</name>
                  <description>1 MHz Free Running Oscillator.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRO12MHZ</name>
                  <description>12 MHz Free Running Oscillator.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_32KHZ</name>
                  <description>32kHz RTC clock.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POFFMODE</name>
              <description>Power Off Mode Control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPMODE</name>
                  <description>Power Mode defined by LPMODE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEROFF</name>
                  <description>PowerOff</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Power Management Controller FSM (Finite State Machines) status</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1FFFFFF</resetMask>
          <fields>
            <field>
              <name>FSMMAIN</name>
              <description>Power Management Controller Main Finite State Machine (FSM) status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FSMMAIN_POWERUP</name>
                  <description>POWER UP : The IC is powering up.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMMAIN_ACTIVE</name>
                  <description>ACTIVE : Power up is completed. The IC is in normal functional operation mode..</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMMAIN_DEEPSLEEP</name>
                  <description>DEEP SLEEP: The IC has entered DEEP SLEEP mode.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMMAIN_SLEEP</name>
                  <description>SLEEP : the IC has entered SLEEP mode.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMMAIN_DFT_ACTIVE</name>
                  <description>IC Structural TEST Mode : The IC has entered in IC Test mode.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMMAIN_POWEROFF</name>
                  <description>POWERDOWN: The IC has entered POWER OFF mode.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMMAIN_POWERDOWN</name>
                  <description>POWERDOWN: The IC has entered POWER DOWN mode.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMMAIN_DEEPPOWERDOWN</name>
                  <description>DEEP POWER DOWN : The IC entred DEEP POWER DOWN mode.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSMPWUP</name>
              <description>POWER UP Finite State Machine (FSM) status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FSMPWUP_RESET</name>
                  <description>RESET : The IC is powering up - reset state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWUP_ENABLE_DCDC</name>
                  <description>ENABLE_DCDC : The IC is powering up - enable DCDC.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWUP_SWITCH_DOMAINS</name>
                  <description>SWITCH_DOMAINS : The IC is powering up - switch domains.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWUP_ENABLE_LDO</name>
                  <description>ENABLE_LDO : The IC is powering up - enable LDO.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWUP_ACTIVATE_MEM</name>
                  <description>ACTIVATE_MEM : The IC is powering up - activate memories</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWUP_RELEASE_ISOLATIONS</name>
                  <description>RELEASE_ISOLATIONS : The IC is powering up - release isolations</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWUP_ENA_FLASH</name>
                  <description>ENA_FLASH : The IC is powering up - enable flash</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWUP_WAIT_FRO192M</name>
                  <description>WAIT_FRO192M : The IC is powering up - wait on FRO192M</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWUP_DONE</name>
                  <description>DONE : The IC is powering up - done</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWUP_RELEASE_RESET</name>
                  <description>RELEASE_RESET : The IC is powering up - release reset</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWUP_TRANSFER_TRIM</name>
                  <description>TRANSFER_TRIM : The IC is powering up - transfer trim</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWUP_SWITCH_CLOCK</name>
                  <description>SWITCH_CLOCK : The IC is powering up - switch clock</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWUP_RELEASE_CPU</name>
                  <description>RELEASE_CPU : The IC is powering up - release CPU</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSMDSLP</name>
              <description>DEEP SLEEP Finite State Machine (FSM) status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FSMDSLP_IDLE</name>
                  <description>IDLE : The IC is entering deep sleep - idle state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMDSLP_PREPARE</name>
                  <description>PREPARE : The IC is entering deep sleep - prepare.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMDSLP_DISABLE_FRO</name>
                  <description>DISABLE_FRO : The IC is entering deep sleep - disable FRO.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMDSLP_SWITCH_TO_DEEPSLEEP</name>
                  <description>SWITCH_TO_DEEPSLEEP : The IC is entering deep sleep - switch to deepsleep.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMDSLP_ENABLE_LDO</name>
                  <description>ENABLE_LDO : The IC is exiting deep sleep - enable LDO.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMDSLP_ENABLE_DCDC</name>
                  <description>ENABLE_DCDC : The IC is exiting deep sleep - enable DCDC.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMDSLP_DONE</name>
                  <description>DONE : The IC is entering deep sleep - done.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMDSLP_PWRUP_BG</name>
                  <description>PWRUP_BG : The IC is exiting deep sleep - power-up bandgap.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMDSLP_PWRUP_DONE</name>
                  <description>PWRUP_DONE : The IC is exiting deep sleep - power-up done.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMDSLP_SWITCH_DOMAINS</name>
                  <description>SWITCH_DOMAINS : The IC is exiting deep sleep - switch domains.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMDSLP_ENABLE_FLASH</name>
                  <description>ENABLE_FLASH : The IC is exiting deep sleep - enable flash.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMDSLP_ACTIVATE_SRAM</name>
                  <description>ACTIVATE_SRAM : The IC is exiting deep sleep - activate SRAM.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMDSLP_PWUP_WAIT_FRO192M</name>
                  <description>PWUP_WAIT_FRO192M : The IC is exiting deep sleep - wait on FRO192M.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSMPWDN</name>
              <description>POWER DOWN Finite State Machine (FSM) status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FSMPWDN_IDLE</name>
                  <description>IDLE : The IC is entering power down - idle state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWDN_DISABLE</name>
                  <description>DISABLE : The IC is entering power down - disable.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWDN_POWER_SHUTOFF</name>
                  <description>POWER_SHUTOFF : The IC is entering power down - power shutoff.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWDN_SHUTOFF</name>
                  <description>SHUTOFF : The IC is entering power down - shutoff.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWDN_PWRUP_ENABLE_DCDC</name>
                  <description>PWRUP_ENABLE_DCDC : The IC is exiting power down - enable DCDC.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWDN_PWRUP_BG</name>
                  <description>PWRUP_BG : The IC is exiting power down - power-up bandgap.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWDN_DISABLE_FRO</name>
                  <description>DISABLE_FRO : The IC is entering power down - disable FRO.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWDN_DONE</name>
                  <description>DONE : The IC is entering power down - done.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWDN_PWRUP_INIT_FLASH</name>
                  <description>PWRUP_INIT_FLASH : The IC is exiting power down - power-up flash initialization.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWDN_PWRUP_DONE</name>
                  <description>PWRUP_DONE : The IC is exiting deep sleep - power-up done.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWDN_PWRUP_ENABLE_LDO</name>
                  <description>PWRUP_ENABLE_LDO : The IC is exiting power down - enable LDO.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWDN_PWRUP_SWITCH_DOMAINS</name>
                  <description>PWUP_SWITCH_DOMAINS : The IC is exiting power down - power-up switch domains.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWDN_PWRUP_RELEASE_ISOLATION</name>
                  <description>PWRUP_RELEASE_ISOLATION : The IC is exiting power down - power-up release isolation.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMPWDN_PWRUP_WAIT_FRO192M</name>
                  <description>PWRUP_WAIT_FRO192M : The IC is exiting power down - power-up wait for FRO192M.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSMDPWD</name>
              <description>DEEP POWER DOWN Finite State Machine (FSM) status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FSMDPWD_IDLE</name>
                  <description>INIT : The IC is entering deep power down - initialization.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMDPWD_POWER_SHUTOFF</name>
                  <description>POWER_SHUTOFF : The IC is entering deep power down - power shutoff.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMDPWD_DONE</name>
                  <description>DONE : The IC is entering deep power down - done.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSMDPWD_DISABLE_FRO</name>
                  <description>DISABLE_FRO : The IC is entering deep power down - disable FRO.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOTMODE</name>
              <description>Latest IC Boot cause:.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWERUP</name>
                  <description>Latest IC boot was a Full power cycle boot sequence (PoR, Pin Reset, Brown Out Detectors Reset, Software Reset).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEEPSLEEP</name>
                  <description>Latest IC boot was from DEEP SLEEP low power mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERDOWN</name>
                  <description>Latest IC boot was from POWER DOWN low power mode.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEEPPOWERDOWN</name>
                  <description>Latest IC boot was from DEEP POWER DOWN low power mode.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSMBLESTATE</name>
              <description>Bluetooth Low Energy Finite State Machine (FSM) status</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>BLE Power FSM : Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LL_AND_MEM_ENABLE</name>
                  <description>BLE Power FSM : Link layer and memory enable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK_OUT_ENABLE</name>
                  <description>BLE Power FSM : Enable clock out</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC_ENABLE</name>
                  <description>BLE Power FSM : Enable oscillator</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_LL_DSLP_AND_PHY_SHUTDOWN</name>
                  <description>BLE Power FSM : Low Power Mode - link Layer deep sleep and phy shutdown</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_OSC_DISABLE</name>
                  <description>BLE Power FSM : Low Power Mode disable oscillator</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RADIO_ACTIVE</name>
                  <description>BLE Power FSM : Radio active</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_ASSERT_ISO_AND_RESETS</name>
                  <description>BLE Power FSM : Low Power Mode assert isolations and resets</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF_TRIGGER_HRESETN</name>
                  <description>BLE Power FSM : Power off mode - trigger hresetn</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF_RADIO_RESTART</name>
                  <description>BLE Power FSM : Power off mode - radio restart</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF_REMOVE_POWER</name>
                  <description>BLE Power FSM : Power off mode - remove power</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RADIO_OFF</name>
                  <description>BLE Power FSM : Power off mode - radio off</description>
                  <value>0xB</value>
