nxp-mcuxpresso/mcux-soc-svd/MCXW235/MCXW235.xml
        <register>
          <name>RTCOSC32K</name>
          <description>RTC 1 KHZ and 1 Hz clocks source control register [Reset by: PoR, Brown Out Detectors Reset]</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FF0008</resetValue>
          <resetMask>0xC7FF800F</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Selects either the XTAL32K or FRO32K as the 32.768kHz clock source for the whole system.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRO32K</name>
                  <description>FRO 32.768 KHz.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL32K</name>
                  <description>XTAL 32.768 KHz.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLK1KHZDIV</name>
              <description>Actual division ratio is : 28 + CLK1KHZDIV.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK1KHZDIVUPDATEREQ</name>
              <description>RTC 1KHz clock Divider status flag.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK1HZDIV</name>
              <description>Actual division ratio is : 31744 + CLK1HZDIV.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK1HZDIVHALT</name>
              <description>Halts the divider counter.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK1HZDIVUPDATEREQ</name>
              <description>RTC 1Hz Divider status flag.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSTIMER</name>
          <description>OS Timer control register [Reset by: PoR, Brown Out Detectors Reset]</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>SOFTRESET</name>
              <description>Active high reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLOCKENABLE</name>
              <description>Enable OS event timer clock.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPDWAKEUPENABLE</name>
              <description>Wake up enable in Deep Power Down mode (To be used in Enable Deep Power Down mode).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSC_PD</name>
              <description>Oscilator 32.768 kHz power down control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSTIMERCLKSEL</name>
              <description>OS event timer clock select.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_0x0</name>
                  <description>32.768kHz clock - FRO32K or XTAL32K (determined by RTCOSC32K.SEL bit)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x1</name>
                  <description>FRO 1MHz clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x3</name>
                  <description>No clock.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUTEVENTS</name>
          <description>Record time-out errors that might occur at different stages during IC power up</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1FFF</resetMask>
          <fields>
            <field>
              <name>PWUP_DCDC_OK</name>
              <description>1: a time out event occured during power up when waiting for DCDC to become functional.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWUP_LDO_OK</name>
              <description>1: a time out event occured during power up when waiting for LDO_MEM or LDO_DIG to become functional.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWUP_FLASHINIT_DONE</name>
              <description>1: a time out event occured during power up when waiting for Flash initialization.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSLP_SRAM_OFF</name>
              <description>1: a time out event occured during deep sleep when waiting for SRAM shut off.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSLP_DCDC_OK</name>
              <description>1: a time out event occured during deep sleep when waiting for DCDC to become functional.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSLP_FLASHINIT_DONE</name>
              <description>1: a time out event occured during deep sleep when waiting for Flash initialization.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSLP_SRAM_WAKEUP</name>
              <description>1: a time out event occured during deep sleep when waiting for SRAM to become functional.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDWN_SRAM_OFF</name>
              <description>1: a time out event occured during power down when waiting for SRAM shut off.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDWN_DCDC_OK</name>
              <description>1: a time out event occured during power down when waiting for DCDC to become functional.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDWN_FLASHINIT_DONE</name>
              <description>1: a time out event occured during power down when waiting for flash initialization to become functional.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSLP_BLE_SHUTDOWN</name>
              <description>1: a time out event occured during deep sleep when waiting for BLE powerdown ack.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDWN_BLE_SHUTDOWN</name>
              <description>1: a time out event occured during power down when waiting for BLE powerdown ack.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWUP_CLK192MHZ_OK</name>
              <description>1: a time out event occured during power up when waiting for oscillator startup.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSLP_CLK192MHZ_OK</name>
              <description>1: a time out event occured during power up from low power state when waiting for oscillator startup.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWDN_CLK192MHZ_OK</name>
              <description>1: a time out event occured during power up from power down state when waiting for oscillator startup.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWUP_BLE_STARTUP</name>
              <description>1: a time out event occured during power up when waiting for BLE.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSLP_BLE_STARTUP</name>
              <description>1: a time out event occured during power up from deepsleep state when waiting for BLE.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWDN_BLE_STARTUP</name>
              <description>1: a time out event occured during power up from power down state when waiting for BLE.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT</name>
          <description>TIMEOUT</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5D90</resetValue>
          <resetMask>0xFFFFF</resetMask>
          <fields>
            <field>
              <name>BLE_RESTART_OSCEN_TIME_OUT</name>
              <description>Time out value for BLE restart. Resolution is 32 us. Default is 160us</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
