nxp-mcuxpresso/mcux-soc-svd/MCXW235/MCXW235.xml
        <register>
          <name>SRAMRETCTRL</name>
          <description>SRAMRETCTRL</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>RETEN_RAMX0</name>
              <description>Controls RAMX0 power down modes during low power modes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DEEP SLEEP: the SRAM instance keeps the configuration it has before entering DEEP SLEEP, what ever it is (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER DOWN, DEEP POWER DOWN and POWEREDOFF: the SRAM instance is in 'Shutdown mode' (In this mode there is no data retention).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The SRAM will go to DEEPSLEEP mode during DEEPSLEEP and POWERDOWN state (In this mode there is data retention), except when it was already in SHUTDOWN state during ACTIVE mode. If it was already in SHUTDOWN during ACTIVE mode, the SRAM will remain in SHUTDOWN.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RETEN_RAMX1</name>
              <description>Controls RAMX1 power down modes during low power modes.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DEEP SLEEP: the SRAM instance keeps the configuration it has before entering DEEP SLEEP, what ever it is (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER DOWN, DEEP POWER DOWN and POWEREDOFF: the SRAM instance is in 'Shutdown mode' (In this mode there is no data retention).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The SRAM will go to DEEPSLEEP mode during DEEPSLEEP and POWERDOWN state (In this mode there is data retention), except when it was already in SHUTDOWN state during ACTIVE mode. If it was already in SHUTDOWN during ACTIVE mode, the SRAM will remain in SHUTDOWN.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RETEN_RAMX2</name>
              <description>Controls RAMX2 power down modes during low power modes.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DEEP SLEEP: the SRAM instance keeps the configuration it has before entering DEEP SLEEP, what ever it is (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER DOWN, DEEP POWER DOWN and POWEREDOFF: the SRAM instance is in 'Shutdown mode' (In this mode there is no data retention).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The SRAM will go to DEEPSLEEP mode during DEEPSLEEP and POWERDOWN state (In this mode there is data retention), except when it was already in SHUTDOWN state during ACTIVE mode. If it was already in SHUTDOWN during ACTIVE mode, the SRAM will remain in SHUTDOWN.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RETEN_RAMX3</name>
              <description>Controls RAMX3 power down modes during low power modes.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DEEP SLEEP: the SRAM instance keeps the configuration it has before entering DEEP SLEEP, what ever it is (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER DOWN, DEEP POWER DOWN and POWEREDOFF: the SRAM instance is in 'Shutdown mode' (In this mode there is no data retention).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The SRAM will go to DEEPSLEEP mode during DEEPSLEEP and POWERDOWN state (In this mode there is data retention), except when it was already in SHUTDOWN state during ACTIVE mode. If it was already in SHUTDOWN during ACTIVE mode, the SRAM will remain in SHUTDOWN.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RETEN_RAM00</name>
              <description>Controls RAM00 power down modes during low power modes.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DEEP SLEEP: the SRAM instance keeps the configuration it has before entering DEEP SLEEP, what ever it is (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER DOWN, DEEP POWER DOWN and POWEREDOFF: the SRAM instance is in 'Shutdown mode' (In this mode there is no data retention).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The SRAM will go to DEEPSLEEP mode during DEEPSLEEP and POWERDOWN state (In this mode there is data retention), except when it was already in SHUTDOWN state during ACTIVE mode. If it was already in SHUTDOWN during ACTIVE mode, the SRAM will remain in SHUTDOWN.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RETEN_RAM10</name>
              <description>Controls RAM10 power down modes during low power modes.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DEEP SLEEP: the SRAM instance keeps the configuration it has before entering DEEP SLEEP, what ever it is (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER DOWN, DEEP POWER DOWN and POWEREDOFF: the SRAM instance is in 'Shutdown mode' (In this mode there is no data retention).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The SRAM will go to DEEPSLEEP mode during DEEPSLEEP and POWERDOWN state (In this mode there is data retention), except when it was already in SHUTDOWN state during ACTIVE mode. If it was already in SHUTDOWN during ACTIVE mode, the SRAM will remain in SHUTDOWN.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RETEN_RAM20</name>
              <description>Controls RAM20 power down modes during low power modes.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DEEP SLEEP: the SRAM instance keeps the configuration it has before entering DEEP SLEEP, what ever it is (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER DOWN, DEEP POWER DOWN and POWEREDOFF: the SRAM instance is in 'Shutdown mode' (In this mode there is no data retention).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The SRAM will go to DEEPSLEEP mode during DEEPSLEEP and POWERDOWN state (In this mode there is data retention), except when it was already in SHUTDOWN state during ACTIVE mode. If it was already in SHUTDOWN during ACTIVE mode, the SRAM will remain in SHUTDOWN.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RETEN_RAMBLEDATA</name>
              <description>Controls BLE Data RAM power down modes during low power modes.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DEEP SLEEP: the SRAM instance keeps the configuration it has before entering DEEP SLEEP, what ever it is (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER DOWN, DEEP POWER DOWN and POWEREDOFF: the SRAM instance is in 'Shutdown mode' (In this mode there is no data retention).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The SRAM will go to DEEPSLEEP mode during DEEPSLEEP and POWERDOWN state (In this mode there is data retention), except when it was already in SHUTDOWN state during ACTIVE mode. If it was already in SHUTDOWN during ACTIVE mode, the SRAM will remain in SHUTDOWN.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RETEN_RAMBLESEQL</name>
              <description>Controls BLE Sequencer/List RAM power down modes during low power modes.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DEEP SLEEP: the SRAM instance keeps the configuration it has before entering DEEP SLEEP, what ever it is (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER DOWN, DEEP POWER DOWN and POWEREDOFF: the SRAM instance is in 'Shutdown mode' (In this mode there is no data retention).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>The SRAM will go to DEEPSLEEP mode during DEEPSLEEP and POWERDOWN state (In this mode there is data retention), except when it was already in SHUTDOWN state during ACTIVE mode. If it was already in SHUTDOWN during ACTIVE mode, the SRAM will remain in SHUTDOWN.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PDRUNCFG0</name>
          <description>PDRUNCFG0</description>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4000C2</resetValue>
          <resetMask>0x6305FF</resetMask>
          <fields>
            <field>
              <name>PDEN_DCDC</name>
              <description>Controls power to DCDC Converter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>DCDC is powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>DCDC is powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_BIAS</name>
              <description>Enable or disable bandgap in high or low power mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LP_MODE</name>
                  <description>Bias 0.66V low power mode enabled. This is intended to be used for retention mode of memory or digital</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HP_MODE</name>
                  <description>Bias 0.63V high accuracy mode enabled. During active mode, the bias must be set in high accuracy mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>Bias disabled.</description>
                  <value>#1x</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_BOD1</name>
              <description>Controls power to Brown Out Detector 1 (BOD1)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>BOD1 is powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>BOD1 is powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_BOD2</name>
              <description>Controls power to Brown Out Detector 2 (BOD2)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>BOD2 is powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>BOD2 is powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_FRO192M</name>
              <description>Controls power to 192MHz Free Running Oscillator</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>FRO 192 MHz is powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>FRO 192 MHz is powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_FRO32K</name>
              <description>Controls power to FRO 32 KHz</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>FRO 32 KHz is powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>FRO 32 KHz is powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_XTAL32K</name>
              <description>Controls power to crystal 32 KHz</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>crystal 32 KHz is powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>crystal 32 KHz is powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_FRO1M</name>
              <description>Controls power to FRO 1 MHz</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>FRO 1 MHz is powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>FRO 1 MHz is powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_BLE</name>
              <description>Control power to BLE</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>BLE retention domain is powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>BLE retention domain is powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_LDOMEM</name>
              <description>Control power to LDO MEM power domain</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>LDO MEM power domain is powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>LDO MEM power domain is powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_LDODIG</name>
              <description>Control power to LDO_DIG power domain</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>LDO DIG power domain is powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>LDO DIG power domain is powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_FLASH</name>
              <description>Control power to Flash block</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>Flash module is powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>Flash module is powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDEN_RNG</name>
              <description>Control power to RNG block</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWEREDON</name>
                  <description>RNG module is powered</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEREDOFF</name>
                  <description>RNG module is powered down</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PDRUNCFGSET0</name>
          <description>Controls the power to various analog blocks [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset]</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDRUNCFGSET0</name>
              <description>Writing ones to this register sets the corresponding bit or bits in the PDRUNCFG0 register, if they are implemented.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
